{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 7, 7)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(7, 7)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 1], [13, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation0_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation0_det_sign0", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv0_det_sign0", 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv0__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv0__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_denseblockenas0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[9, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation3_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation3_det_sign0", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv3_det_sign0", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv3_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv3__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv3__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_denseblockenas2_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[22, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm6_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation6_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation6_det_sign0", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv6_det_sign0", 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv6_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv6__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv6__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_denseblockenas4_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[35, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm9_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm9_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm9_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm9_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm9_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 1], [52, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation9_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation9_det_sign0", 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv9_det_sign0", 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv9_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[55, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv9__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv9__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_denseblockenas6_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[48, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 1], [65, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(160, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "160", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation0_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation0_det_sign0", 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv0_det_sign0", 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[77, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv0__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv0__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[70, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0], [86, 0, 1], [87, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation3_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation3_det_sign0", 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv3_det_sign0", 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv3_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[90, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv3__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv3__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas2_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[83, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm6_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 1], [100, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation6_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation6_det_sign0", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv6_det_sign0", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv6_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv6__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv6__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas4_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[96, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm9_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm9_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm9_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm9_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm9_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 1], [113, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation9_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation9_det_sign0", 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv9_det_sign0", 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv9_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[116, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv9__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv9__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas6_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[109, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm12_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm12_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm12_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm12_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm12_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation12_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation12_det_sign0", 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv12_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv12_det_sign0", 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv12_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[129, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv12__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv12__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas8_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[122, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(224, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "224", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 1], [148, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage3_qactivation0_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qactivation0_det_sign0", 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_qconv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qconv0_det_sign0", 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_qconv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage3_qconv0__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage3_qconv0__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage3_denseblockenas0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[144, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0], [159, 0, 0], [160, 0, 1], [161, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage3_qactivation3_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qactivation3_det_sign0", 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_qconv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qconv3_det_sign0", 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_qconv3_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[164, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage3_qconv3__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage3_qconv3__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage3_denseblockenas2_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[157, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_batchnorm6_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0], [173, 0, 1], [174, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage3_qactivation6_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qactivation6_det_sign0", 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_qconv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qconv6_det_sign0", 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_qconv6_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[177, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage3_qconv6__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage3_qconv6__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage3_denseblockenas4_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[170, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm9_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm9_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm9_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm9_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_batchnorm9_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[183, 0, 0], [184, 0, 0], [185, 0, 0], [186, 0, 1], [187, 0, 1]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage3_qactivation9_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qactivation9_det_sign0", 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_qconv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qconv9_det_sign0", 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_qconv9_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[190, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage3_qconv9__plusscalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage3_qconv9__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage3_denseblockenas6_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[183, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[196, 0, 0], [197, 0, 0], [198, 0, 0], [199, 0, 1], [200, 0, 1]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[201, 0, 0]]
    }, 
    {
