{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 7], [6, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation0_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation0_det_sign0", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv0_det_sign0", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv0__plusscalar0", 
      "attrs": {"scalar": "64"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv0__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_denseblockenas0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[2, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hybridsequential6_slice_axis0", 
      "attrs": {
        "axis": "1", 
        "begin": "0", 
        "end": "64"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hybridsequential6_slice_axis1", 
      "attrs": {
        "axis": "1", 
        "begin": "64", 
        "end": "128"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[15, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 7], [21, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation2_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation2_det_sign0", 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "stage1_qconv2_pad0", 
      "attrs": {
        "constant_value": "-1", 
        "mode": "constant", 
        "pad_width": "[0, 0, 0, 0, 1, 1, 1, 1]"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 128, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv2_det_sign0", 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv2__plusscalar0", 
      "attrs": {"scalar": "1152"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv2__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "hybridsequential6__plus0", 
      "inputs": [[17, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "hybridsequential6_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[16, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 7], [36, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation3_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation3_det_sign0", 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv3_det_sign0", 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv3_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv3__plusscalar0", 
      "attrs": {"scalar": "128"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv3__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_denseblockenas2_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[32, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hybridsequential6_slice_axis2", 
      "attrs": {
        "axis": "1", 
        "begin": "0", 
        "end": "128"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hybridsequential6_slice_axis3", 
      "attrs": {
        "axis": "1", 
        "begin": "128", 
        "end": "192"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm5_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm5_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm5_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm5_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm5_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[45, 0, 0], [48, 0, 0], [49, 0, 0], [50, 0, 7], [51, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation5_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation5_det_sign0", 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "stage1_qconv5_pad0", 
      "attrs": {
        "constant_value": "-1", 
        "mode": "constant", 
        "pad_width": "[0, 0, 0, 0, 1, 1, 1, 1]"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 192, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv5_det_sign0", 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv5_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[55, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv5__plusscalar0", 
      "attrs": {"scalar": "1728"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv5__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "hybridsequential6__plus1", 
      "inputs": [[47, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "hybridsequential6_concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[46, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm6_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 7], [66, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation6_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation6_det_sign0", 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv6_det_sign0", 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv6_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv6__plusscalar0", 
      "attrs": {"scalar": "192"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv6__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_denseblockenas4_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[62, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm10_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm10_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm10_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_batchnorm10_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_batchnorm10_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 7], [79, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage1_qactivation10_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qactivation10_det_sign0", 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "stage1_qconv10_pad0", 
      "attrs": {
        "constant_value": "-1", 
        "mode": "constant", 
        "pad_width": "[0, 0, 0, 0, 1, 1, 1, 1]"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_qconv10_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage1_qconv10_det_sign0", 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_qconv10_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage1_qconv10__plusscalar0", 
      "attrs": {"scalar": "2304"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage1_qconv10__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_denseblockenas7_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[75, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 7], [93, 0, 7]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(160, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "160", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 7], [102, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation0_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation0_det_sign0", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv0_det_sign0", 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[105, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv0__plusscalar0", 
      "attrs": {"scalar": "160"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv0__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[98, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hybridsequential6_slice_axis4", 
      "attrs": {
        "axis": "1", 
        "begin": "0", 
        "end": "160"
      }, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hybridsequential6_slice_axis5", 
      "attrs": {
        "axis": "1", 
        "begin": "160", 
        "end": "224"
      }, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[111, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 7], [117, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation2_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation2_det_sign0", 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "stage2_qconv2_pad0", 
      "attrs": {
        "constant_value": "-1", 
        "mode": "constant", 
        "pad_width": "[0, 0, 0, 0, 1, 1, 1, 1]"
      }, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 224, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv2_det_sign0", 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv2__plusscalar0", 
      "attrs": {"scalar": "2016"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv2__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "hybridsequential6__plus2", 
      "inputs": [[113, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "hybridsequential6_concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[112, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm3_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0], [131, 0, 7], [132, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation3_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation3_det_sign0", 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv3_det_sign0", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv3_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[135, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv3__plusscalar0", 
      "attrs": {"scalar": "224"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv3__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas2_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[128, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm6_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0], [143, 0, 0], [144, 0, 7], [145, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation6_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation6_det_sign0", 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv6_det_sign0", 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv6_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[148, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv6__plusscalar0", 
      "attrs": {"scalar": "288"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv6__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas4_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[141, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm10_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm10_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm10_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm10_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm10_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0], [157, 0, 7], [158, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation10_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation10_det_sign0", 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "stage2_qconv10_pad0", 
      "attrs": {
        "constant_value": "-1", 
        "mode": "constant", 
        "pad_width": "[0, 0, 0, 0, 1, 1, 1, 1]"
      }, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv10_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv10_det_sign0", 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv10_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[162, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv10__plusscalar0", 
      "attrs": {"scalar": "3168"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv10__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas7_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[154, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm13_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm13_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm13_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_batchnorm13_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_batchnorm13_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0], [171, 0, 7], [172, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage2_qactivation13_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qactivation13_det_sign0", 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "stage2_qconv13_pad0", 
      "attrs": {
        "constant_value": "-1", 
        "mode": "constant", 
        "pad_width": "[0, 0, 0, 0, 1, 1, 1, 1]"
      }, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_qconv13_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage2_qconv13_det_sign0", 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_qconv13_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[176, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage2_qconv13__plusscalar0", 
      "attrs": {"scalar": "3744"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage2_qconv13__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_denseblockenas9_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[168, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0], [184, 0, 0], [185, 0, 7], [186, 0, 7]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(224, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "224", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0], [193, 0, 0], [194, 0, 7], [195, 0, 7]]
    }, 
    {
      "op": "_contrib_gradcancel", 
      "name": "stage3_qactivation0_gradcancel0", 
      "attrs": {"threshold": "1.0"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qactivation0_det_sign0", 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_qconv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "0.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "det_sign", 
      "name": "stage3_qconv0_det_sign0", 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_qconv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[198, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "stage3_qconv0__plusscalar0", 
      "attrs": {"scalar": "224"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "stage3_qconv0__divscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage3_denseblockenas0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[191, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hybridsequential6_slice_axis6", 
      "attrs": {
        "axis": "1", 
        "begin": "0", 
        "end": "224"
      }, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "slice_axis", 
      "name": "hybridsequential6_slice_axis7", 
      "attrs": {
        "axis": "1", 
        "begin": "224", 
        "end": "288"
      }, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
